Обработки/Reports/_ЕПС_ФинансовыеРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЕПС_ФинансовыеРезультаты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЕПС_ФинансовыеРезультаты/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"ЕПС Финансовые результаты",
		"1.46",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидСредств
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу + "", №"" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Номер + "" от "" КАК НаименованиеУправляющейКомпании,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") + "", №"" + СтатусыЛицензийСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийСрезПоследних.Лицензия.Номер + "" от "" КАК НаименованиеФонда,
		|	СтатусыЛицензийСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензииНПФ,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензииУК,
		|	_КлиентДоверительногоУправления.ВидСредств КАК ВидСредств
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)) КАК СтатусыЛицензийОрганизацииСрезПоследних
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ЮрФизЛицо,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоПенсионномуСтрахованию)) КАК СтатусыЛицензийСрезПоследних
		|		ПО _КлиентДоверительногоУправления.Клиент = СтатусыЛицензийСрезПоследних.Лицензия.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала, КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	
	ВидыСубконто = Новый Массив;
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);	
	
	Настройки = КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 					ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 					Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериодаДляВывода", 			ЭтотОбъект.Период.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыСубконто",					ВидыСубконто);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));

	СписокКодовГФУ_Дивиденды = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("34501, 34502, 34503, 34504, 34601, 34602, 34603, 34604",",", Истина, Истина);
	МассивГФУ_Дивиденды = Новый Массив;
	Для Каждого ТекЭлемент Из СписокКодовГФУ_Дивиденды Цикл
		МассивГФУ_Дивиденды.Добавить(Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду(ТекЭлемент));	
	КонецЦикла;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ГФУДивиденды", МассивГФУ_Дивиденды);

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДивидендов", ПланыСчетов.Единый.ДоходыРасходыОтОпераций05);
	
	//СписокСчетовОФР = Новый Массив;
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы01);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы04);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы05);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы06);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций03);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций05);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций04);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций06);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы01);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы02);
	//СписокСчетовОФР.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокСчетовОФР", СписокСчетовОФР);
	//
	//ЦенныеБумагиГФУ = Новый Массив;
	//ЦенныеБумагиГФУ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	//ЦенныеБумагиГФУ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов);

	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЦенныеБумагиГФУ", ЦенныеБумагиГФУ);

	//СчетаДС = Новый Массив;
	//СчетаДС.Добавить(ПланыСчетов.Единый.РасчетныеСчета);
	//СчетаДС.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами);
	//СчетаДС.Добавить(ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05);
	//
	//СчетаЦБ = Новый Массив;
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	//
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетаДС", 		СчетаДС);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетаЦБ", 		СчетаЦБ);
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Счет", 		СписокСчетов);

	ПараметрыШапки = ПолучитьПараметрыШапки();
	
	Если ПараметрыШапки.ДатаЛицензииНПФ = NULL ИЛИ ПараметрыШапки.ДатаЛицензииНПФ = '00010101' Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильно заполнены лицензии клиента!");
		Возврат;
	
	КонецЕсли;

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеФонда", 				 ПараметрыШапки.НаименованиеФонда + Формат(ПараметрыШапки.ДатаЛицензииНПФ, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеУправляющейКомпании", ПараметрыШапки.НаименованиеУправляющейКомпании + Формат(ПараметрыШапки.ДатаЛицензииУК, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 					 ПараметрыШапки.НомерДоговора + " от " + Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидСредств", 				 	 ПараметрыШапки.ВидСредств);

	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей);

КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
